/*

头文件		名字空间		描述
<deque>		std			双端队列容器，它是一个由连续存储的指向不同元素的指针所组成的数组
<queue>		std			队列容器，按照先进先出的规则排列容器中的数据
<stack>		std			堆栈容器，按照后进先出的规则排列容器中的数据
<vector>	std			动态数组容器，连续存储的容器中的元素，它是最常用的非关联容器
------------------------------------------
<map>				 |		|映射容器，由键值对组成的集合，以某种作用于键值对上的谓词排列，
<multimap>			 |	std |它是最常用的关联映射容器。其中，map 容器中的键值对是一一对应的关系，而 multimap 容器中的一个键可以对应多个值
<unordered_map>		 |		|作为映射容器，map 和 multimap 由来已久，其底层由红黑树实现，
<unordered_multimap> |		|而 unorderd_map 和 unordered_multimap 是最新的 C++0x 标准新添加入 STL 的映射容器，其底层由哈希表实现
------------------------------------------
<set>				 |		|
<multiset>			 | std	|
<unordered_set>		 |		|
<unordered_multiset> |		|
------------------------------------------
*/

